Revit 2026 API

# RebarShapeConstraintFixedSegmentDirDirection Property

---

The direction of the RebarShapeSegment in UV-space.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV Direction { get; set; }
```
```vb
Public Property Direction As UV
	Get
	Set
```
```cpp
public:
property UV^ Direction {
	UV^ get ();
	void set (UV^ value);
}
```
```fsharp
member Direction : UV with get, set
```

#### Property Value

UV

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

RebarShapeConstraintFixedSegmentDir Class

Autodesk.Revit.DB.Structure Namespace